

using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
 
namespace Logitude.Accounting.BL.CloseTables
{
    public struct WithholdingTaxDeductionTypeValues
    {   
       public const string מקבליריביתוהפרשיהצמדהתשלומיםבעדדמיהשאלהתשלומיםתמורתמכירתניירערךזר = "01";  
       public const string מקבליעמלותביטוח = "02";  
       public const string מקבלישכרסופריםאמניםבוחניםמרציםמעניקישרותימשרדוספורטאיםשאינםשכיריםדירקטורים = "03";  
       public const string תשלומיםבעדעבודהחקלאיתאותוצרתחקלאית = "05";  
       public const string מקבליתשלומיםבעדשירותים = "06";  
       public const string תשלוםשלאכדיןמקופתגמל = "11";  
       public const string החזרתשלוםלמעבידמקופתגמללפיצויים = "12";  
       public const string תשלומיםבעדשכירותמקרקעיןשניתןלתבועכהוצאה = "13";  
       public const string תשלוםמקרןהשתלמותלעצמאי = "14";  
       public const string תשלומיםמהשתכרותאורווחשמקורםבהימוריםהגרלותופעילותנושאתפרסים = "15";  
       public const string ניכוימתשלומיםבעדמטבעותוירטואליים = "16";  
       public const string תשלוםדיבידנד = "18";  
       public const string רווחהוןמפדיוןמניות/אופציותלפיסעיף102 = "19";  
       public const string סוגזהמיוחדאךורקלתיקהמוסדלביטוחלאומילצורךדיווחתשלומיגמלאותוקצבאות = "20";  
       public const string הכנסהמהפקתחשמלבמסלולפטור = "21";  
       public const string הכנסהמהפקתחשמלבמסלולמסמופחת = "22";  
       public const string החזרתסכומיםמקופתהגמללמעסיק = "53";  
       public const string החזרתסכומיםמקופתהגמללמעסיקלפיאישורפקידשומה = "54";  
       public const string מענקפרישהפטורממס = "56";  
       public const string מענקפרישהעקבמוותפטורממס = "57";  
       public const string מענקפרישהחייבבמס = "58";  
       public const string מענקפרישהעקבמוותחייבבמס = "59";  
       public const string מענקפרישהשחויבבשוויבעתההפקדה(פטור) = "60";  
       public const string רווחיםצבוריםמהפקדותשחויבובשוויבעתההפקדה(15%) = "61";  
       public const string משיכהשלקרןורווחיםמקופתהגמלשניתןלמשוךבפטור = "63";  
       public const string משיכהמקופתהגמלבניגודלהוראותסעיף87לפקודה = "64";  
       public const string משיכהמקופתהגמלבעילהשלהעדרהכנסות(פטור) = "65";  
       public const string משיכהאחרתמקופתהגמלבאישורפקידשומה = "66";  
       public const string משיכהמקופתהגמלבעילהסוציאליתולפיאישורפקידשומה = "67";  
       public const string היווןקצבהמזכהעלפיאישורפש = "68";  
       public const string היווןקצבהבפטורעלפיאישורפש = "69";  
       public const string היווןסכוםצבירהמזעריעלפיאישורפקידשומה(פטור) = "70";  
       public const string קרןהשתלמות-משיכתקרןורווחיםשמקורםב-הפקדהמוטבת-לשםהשתלמותאוהגעהל\"גילפרישה(פטור) = "74";  
       public const string קרןהשתלמות-משיכת\"סכומיםמקרןהשתלמות\"כהגדרתםבתקנותמקרןהשתלמותלשכירים = "75";  
       public const string קרןהשתלמות-משיכת\"סכומיםמקרןהשתלמות\"כהגדרתםבתקנותמקרןהשתלמותלעצמאים = "76";  
       public const string קרןהשתלמות-משיכתסכומיםשמועטומהגדרת\"סכומיםמקרןהשתלמות\"(פטור) = "77";  
       public const string קרןהשתלמות-משיכתהפקדהשאינה\"הפקדהמוטבת\"בתוספתהפרשיהצמדה(פטור)בהתאםלסעיף3(ה4)(1)לפקודה = "78";  
       public const string קרןהשתלמות-משיכתרווחיםצבוריםמהפקדהשאינה\"הפקדהמוטבת\"(15%)בהתאםלסעיף3(ה4)(1)לפקודה = "79";  
       public const string קרןהשתלמות-משיכתרווחיםצבוריםמהפקדהשאינה\"הפקדהמוטבת\"(20%)בהתאםלסעיף3(ה4)(1)לפקודה = "80";  
       public const string קרןהשתלמות-משיכתרווחיםצבוריםמהפקדהשאינה"הפקדהמוטבת"(25%)בהתאםלסעיף3(ה4)(1)לפקודה = "81";  
       public const string העברהלחשבונושלבןהזוגלשעבר-העברתסכומיםשמתחתלתקרה(פטור) = "82";  
       public const string העברהלחשבונושלבןהזוגלשעבר-העברתסכומיםשמעללתקרה(סעיף124ג) = "83";  
       public const string משיכתסכומיםבגיןימיחופשהמחלהאוחגבמהלךתקופתעבודה(25%/40%) = "85";  
       public const string משיכתסכומיםבגיןימיחופשהמחלהאוחגבמועדסיוםעבודה(40%/25%) = "86";  
       public const string תשלוםמחשבוןחדשאוקופתגמללהשקעה-קרןכוללהפרשיהצמדהעלהקרן(פטור) = "87";  
       public const string תשלוםמחשבוןחדשאוקופתגמללהשקעה-\"ריביתורווחיםאחרים\"(25%) = "88";  
       public const string קופתגמלפנסיהלעצמאים-משיכתסכומיםבמצבאבטלה(פטור) = "91";  
       public const string קופתגמלפנסיהלעצמאים-משיכתסכומיםבמצבאבטלה(לפיאישור) = "92";  
       public const string תשלוםחדפעמיבגיןאובדןכושרעבודה-סכוםהקצבאותששולמובסכוםחדפעמי = "95";  
       public const string תשלומיםלתושבחוץלפיסעיף170לפקודהכשהמסנוכהוהועברלפקידהשומהע\"יהמנכה = "07";  
       public const string תשלומיםלתושבחוץלפיסעיף170לפקודהכשהמסנוכהוהועברלפקידהשומהע\"יהבנק = "08";  
       public const string היווןקצבהמוכרתחלק\"תשלומיםפטורים\"(פטור) = "71";  
       public const string היווןקצבהמוכרתחלק\"מרכיבהרווחהיחסי\"(15%) = "72";  
    }
}

